rule havoc_c2_default_beacon_detection {
  meta:
    author = "Dan Lussier"
    description = "Detect C2 activity to Havoc"
    version = "1.0"
    severity = "High"
    mitre_TA = "TA0011"
    mitre_T1 = "T1071.001"
    mitre_url = "https://attack.mitre.org/techniques/T1071/001/"

  events:
    $e1.metadata.event_type = "NETWORK_HTTP"
    $e1.target.hostname = $targetDomain
    $e1.network.received_bytes = 243 or // all checkin's are 243 bytes.
    $e1.network.received_bytes = 195 // some are now also 195 in the newer version
    $e1.network.http.response_code = 200

    // Match Condition
    $e1.principal.ip = $srcIP
       
  match:
       $targetDomain, $srcIP over 10m
    
  outcome: 
        $risk_score = max(
        if ($e1.network.received_bytes = 243, 80) +
        if ($e1.network.received_bytes = 195, 80) //adjust your score accordingly
        )
        $targetDomain_distinct_count = count_distinct($targetDomain)
        $targetDomain_count = count($targetDomain)
        $targetDomain_distinct = array_distinct($targetDomain)
        $target_Domain = array($targetDomain)

  condition:
       #e1 > 20
}
